#### 📖 Terraform Plan ('infra-pe/resources/uat') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-u-itn-cgn-attribute-authority-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-u-itn-cgn-pe-rg-01"
      + sku_name                     = "F1"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.networking.module.pep_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.30.2.0/23",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-u-itn-cgn-pe-pep-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-u-itn-cgn-pe-rg-01"
      + virtual_network_name                           = "io-u-itn-cgn-pe-vnet-01"
    }

  # module.networking.module.vnet_common.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.30.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-u-itn-cgn-pe-vnet-01"
      + resource_group_name = "io-u-itn-cgn-pe-rg-01"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + ddos_protection_plan {
          + enable = true
          + id     = "/subscriptions/0da48c97-355f-4050-a520-f11a18b8be90/resourceGroups/sec-p-ddos/providers/Microsoft.Network/ddosProtectionPlans/sec-p-ddos-protection"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

Error: Virtual Network (Subscription: "d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d"
Resource Group Name: "io-u-itn-cgn-pe-rg-01"
Virtual Network Name: "io-u-itn-cgn-pe-vnet-01") was not found

  with module.app_service_attribute_authority.module.app_service_attribute_authority.data.azurerm_virtual_network.this,
  on .terraform/modules/app_service_attribute_authority.app_service_attribute_authority/infra/modules/azure_app_service/data.tf line 1, in data "azurerm_virtual_network" "this":
   1: data "azurerm_virtual_network" "this" {


Error: Private Dns Zone (Subscription: "d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d"
Resource Group Name: "io-u-itn-cgn-pe-rg-01"
Private Dns Zone Name: "privatelink.azurewebsites.net") was not found

  with module.app_service_attribute_authority.module.app_service_attribute_authority.data.azurerm_private_dns_zone.app_service,
  on .terraform/modules/app_service_attribute_authority.app_service_attribute_authority/infra/modules/azure_app_service/data.tf line 6, in data "azurerm_private_dns_zone" "app_service":
   6: data "azurerm_private_dns_zone" "app_service" {

::error::Terraform exited with code 1.
```

</details>
